ninety-nine-cats/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)

        if @cat&.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "name" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["birth_date", "2022-09-01"], ["color", "white"], ["name", "Fall"], ["description", ""], ["updated_at", "2022-09-16 23:51:53.509363"], ["id", 3]]